tutorials/fluidSolidInteraction/3dTube/compressibleLiquid3dTube/constant/solid/solidProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.0                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      solidProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solidModel    linearGeometryTotalDisplacement;
//solidModel    nonLinearGeometryUpdatedLagrangian;
//solidModel 	unsNonLinearGeometryTotalLagrangian;
//solidModel 	nonLinearGeometryTotalLagrangian;
//solidModel    unsNonLinearGeometryUpdatedLagrangian;
//solidModel    nonLinearGeometryTotalLagrangianTotalDisplacement;

"linearGeometryTotalDisplacementCoeffs|\
unsLinearGeometryCoeffs|\
nonLinearGeometryTotalLagrangianTotalDisplacementCoeffs|\
nonLinearGeometryTotalLagrangianCoeffs|\
unsNonLinearGeometryTotalLagrangianCoeffs|\
nonLinearGeometryUpdatedLagrangianCoeffs|\
unsNonLinearGeometryUpdatedLagrangianCoeffs"
{
    // Maximum number of momentum correctors
    //nCorrectors             20000;

    // Solution tolerance for displacement
    //solutionTolerance       1e-09;

    // Alternative solution tolerance for displacement
    //alternativeTolerance    1e-09;

    // Material law solution tolerance
    //materialTolerance       1e-05;

    // Write frequency for the residuals
    infoFrequency           100;
}

// ************************************************************************* //
